In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\sravani\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\sravani\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\sravani\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\sravani\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\sravani\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

## Series

In [3]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

In [4]:
population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [5]:
population = pd.Series(population_dict)
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [6]:
population.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [7]:
population['California']

38956785

In [8]:
type(population)

pandas.core.series.Series

In [9]:
population.shape

(5,)

In [10]:
import pandas as pd
population_dict2 = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population2=pd.Series(population_dict2)
df = pd.DataFrame(population2)
df

                   0
California  38956785
Texas       26441568
New York    19555647
Florida     12364569
Illinois    12882135

In [11]:
df.shape

(5, 1)

In [12]:
df = pd.DataFrame(population2,columns = ['Population']) #changing the name of the dataframe while creating

In [13]:
df

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [14]:
data = [{'a':i,'b':2*i} for i in range(3)]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [15]:
df2 = pd.DataFrame(data)

In [16]:
df2

   a  b
0  0  0
1  1  2
2  2  4

In [17]:
df2 = pd.DataFrame(data,index = ['X','Y','Z'])

In [18]:
df2

   a  b
X  0  0
Y  1  2
Z  2  4

In [19]:
df2.columns = ['Col 1','Col 2']   #renaming the columns

In [20]:
df2

   Col 1  Col 2
X      0      0
Y      1      2
Z      2      4

In [21]:
df2.columns[1]

'Col 2'

In [22]:
df2.columns

Index(['Col 1', 'Col 2'], dtype='object')

## To access a 'csv' file from the local disk

In [23]:
#### exploratory data analysis



df3 = pd.read_csv(r'C:\Users\Sravani\Desktop\BroadInfinity\pandas\student_records.csv')

In [24]:
df3

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90          85.0       Yes
1    John            C        N             85          51.0       Yes
2   David            F        N             10          17.0        No
3  Holmes            B        Y             75          71.0        No
4  Marvin            E        N             20          30.0        No
5   Simon            A        Y             92          79.0       Yes
6  Robert            B        Y             60          59.0        No
7   Trent            C        Y             75          33.0        No
8    Judy          NaN        Y             25           NaN        No
9   Chris            D        U             25          15.0        NO

In [25]:
df3.head()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90          85.0       Yes
1    John            C        N             85          51.0       Yes
2   David            F        N             10          17.0        No
3  Holmes            B        Y             75          71.0        No
4  Marvin            E        N             20          30.0        No

In [26]:
df3.tail()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
5   Simon            A        Y             92          79.0       Yes
6  Robert            B        Y             60          59.0        No
7   Trent            C        Y             75          33.0        No
8    Judy          NaN        Y             25           NaN        No
9   Chris            D        U             25          15.0        NO

In [27]:
df3.shape

(10, 6)

In [28]:
df3.size

60

In [29]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           10 non-null     object
 1   OverallGrade   9 non-null      object
 2   Obedient       10 non-null     object
 3   ResearchScore  10 non-null     int64
 4   ProjectScore   9 non-null      float64
 5   Recommend      10 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 608.0+ bytes

In [30]:
df.describe()    #describe is a function that give statistical info about the numerical columns

         Population
count  5.000000e+00
mean   2.204014e+07
std    1.105898e+07
min    1.236457e+07
25%    1.288214e+07
50%    1.955565e+07
75%    2.644157e+07
max    3.895678e+07

In [31]:
df3.isnull().sum()

Name             0
OverallGrade     1
Obedient         0
ResearchScore    0
ProjectScore     1
Recommend        0
dtype: int64

In [32]:
df3.dropna()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90          85.0       Yes
1    John            C        N             85          51.0       Yes
2   David            F        N             10          17.0        No
3  Holmes            B        Y             75          71.0        No
4  Marvin            E        N             20          30.0        No
5   Simon            A        Y             92          79.0       Yes
6  Robert            B        Y             60          59.0        No
7   Trent            C        Y             75          33.0        No
9   Chris            D        U             25          15.0        NO

In [33]:
df3.sample()    #about the data

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
3  Holmes            B        Y             75          71.0        No

In [34]:
df3['Recommend'].value_counts()

No     6
Yes    3
NO     1
Name: Recommend, dtype: int64

In [35]:
df3.isna()   # This function returns a dataframe filled with boolean values with true indicating missing values.

    Name  OverallGrade  Obedient  ResearchScore  ProjectScore  Recommend
0  False         False     False          False         False      False
1  False         False     False          False         False      False
2  False         False     False          False         False      False
3  False         False     False          False         False      False
4  False         False     False          False         False      False
5  False         False     False          False         False      False
6  False         False     False          False         False      False
7  False         False     False          False         False      False
8  False          True     False          False          True      False
9  False         False     False          False         False      False

In [36]:
df3.isnull().sum()

Name             0
OverallGrade     1
Obedient         0
ResearchScore    0
ProjectScore     1
Recommend        0
dtype: int64

In [37]:
df3['ProjectScore'].mean()

48.888888888888886

In [38]:
df3 = df3['ProjectScore'].fillna(df3['ProjectScore'].mean())

In [39]:
df3

0    85.000000
1    51.000000
2    17.000000
3    71.000000
4    30.000000
5    79.000000
6    59.000000
7    33.000000
8    48.888889
9    15.000000
Name: ProjectScore, dtype: float64

## Walmart data